[
    {
        "question": "What caused the PW Orca aircraft to crash?",
        "ground_truth_chunks": [
            ".  Approximately 250 m from the accident site was an outdoor activity centre.\nFigure 2\nAircraft wreckage\n18\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 PW Orca AAIB-30757\nAircraft information\nThe aircraft (Figure 3) is an unmanned, electrically powered vertical takeoff and landing \naircraft.  It is equipped with eight propulsion motors.  Six motors are installed under the \nwings, and these provide vertical takeoff and landing capability.  Two motors are mounted at \nthe front of the wings that provide propulsion during forward flight.  The MTOW of the aircraft \nis 52 kg with a cruise speed of 60 kt and maximum range of 54 nm.\nThe aircraft is controlled remotely from a ground control station, and by an optional \nSRP controller.  The ground control station to aircraft communications system provides \nuninterrupted signals that enable the aircraft to be operated BVLOS.  The signals between \nthe SRP controller and aircraft are limited by range and line of sight.\nAt the time of report publication, 26 aircraft have been manufactured, of which 20 remain \nin operational service.  The accident aircraft had accumulated a total of 13 hours and  \n59 minutes flight time and had completed 119 flights prior to the accident.  This was the first \naccident involving this type.\n \nFigure 3\nPW Orca \n(used with permission)\n19\nAll times are UTC©  Crown copyright 2025\n AAIB",
            "15\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 PW Orca AAIB-30757\nAccident\n \nAircraft Type and Registration: Phoenix Wings Orca\nNo & Type of Engines: 8 electric motors\nYear of Manufacture: 2024 (Serial no: PW54)\nDate & Time (UTC): 25 March 2025 at 1450 hrs\nLocation: Coombe Country Park, Warwickshire\nType of Flight: Commercial Operations (UAS)\nPersons on Board: Crew - None Passengers - None\n \nInjuries: Crew - N/A Passengers - N/A\n \nNature of Damage: Damaged beyond economic repair\nCommander’s Licence: Other\nCommander’s Age: 23 years\nCommander’s Flying Experience: 85 hours (of which 5 were on type)\n Last 90 days - 16 hours\n Last 28 days -   7 hours\nInformation Source: Aircraft Accident Report Form submitted by the \npilot\n \nSynopsis\nThe aircraft struck the ground in a wooded area whilst on approach to land at a site adjacent \nto Coventry Hospital.  The accident occurred during the sixth consecutive flight, which was in \npreparation for demonstrating the aircraft being operated in accordance with the operator’s \nBeyond Visual Line Of Sight with Visual Mitigations (BVLOS VM) authorisation.\nThe cause of the accident was identified as a software bug in combination with a loss \nof synchronisation between the Remote Pilot (RP) and the Safety Remote Pilot (SR",
            " 119 flights prior to the accident.  This was the first \naccident involving this type.\n \nFigure 3\nPW Orca \n(used with permission)\n19\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 PW Orca AAIB-30757\nFlight termination system (FTS) \nThe aircraft is equipped with a FTS which, when activated, removes power from its electric \npropulsion motors and deploys the parachute2.  The ailerons also move to place the aircraft \ninto a spin, which is intended to quickly reduce any forward movement of the aircraft as it \ndescends.  This system can bring the aircraft safely to the ground at a controlled rate in \nthe event of an emergency.  The aircraft manufacturer’s minimum deployable height for the \nparachute to be fully effective is 60 m above the ground3.\nThe FTS activates automatically if the aircraft’s descent rate exceeds 2,000 fpm, or it can \nbe manually triggered by selection of a terminate push button on the RP ground station or \nswitch on the SRP controller (Figure 4).\nArm and disarm function\nThe arm and disarm function applied or removed power to the electric propulsion motors \nrespectively and enabled or disabled remote control of the aircraft.  Upon landing the aircraft \nwas designed to automatically disarm itself, enabling it to be safely approached by ground \npersonnel.  The design of the system also allowed the aircraft to be manually disarmed \nwhen in flight or on the ground.\n",
            ".\nThe aircraft was observed to follow the planned flight profile but as it approached approximately \nthe halfway point the aircraft’s motors suddenly stopped.  The aircraft initially maintained \naltitude but subsequently stalled, before descending quickly and striking the ground within \na wooded area (Figure 1).  No persons were injured and there was no damage to property; \nthe aircraft was damaged beyond repair.\nThe RP, SRP and PM reported that they had not made any selections on their respective \ncontrollers in the period before the aircraft departed from controlled flight.\nFootnote\n1 The VO is a designated person who assists the pilot during BVLOS flights.  The VO’s primary responsibility is \nto maintain visual contact with the aircraft and its surroundings, alerting the remote pilot who may not be able \nto observe the aircraft to any potential hazards or conflicts.  The VO provides the visual mitigations required \nby the BVLOS VM authorisation.\n17\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 PW Orca AAIB-30757\nFigure 1\nRelative position of takeoff, landing and accident sites\n© 2025 Google, Image © 2025 Airbus\nAccident site \nThe aircraft struck the ground in a wooded area (Figure 2) which was accessible to the \npublic.  Approximately 250 m from the accident site was an outdoor activity centre.\nFigure 2\nAircraft wreckage\n18\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 PW Orca",
            " he had not moved this switch during the flight.  It is therefore most likely that the \nselection was synchronised correctly with the RP after the aircraft had landed at the farm, \nbut a loss of synchronisation with the RP then occurred, with the selection remaining in the \ndisarm position when the aircraft took off.\nThe checklist used by the RP and SRP did not include a formal verification (check and \nchallenge) of the arm/disarm switch selection.  This increased the possibility that a loss of \nsynchronisation between the two remote pilots was not detected and this risk may have \nbeen further increased by conducting a number of flights in relatively quick succession.\nAlthough the SRP controller was inadvertently set in the disarm position when \ncommunication was established with the aircraft, this scenario had already been considered \nby the manufacturer that had designed the system so that it would not disarm the aircraft \nin this eventuality.  However, the change to the software in November 2024, which was not \nretested against the scenario above prior to its release, unintentionally resulted in the aircraft \ndisarming in flight.  This also disabled the FTS, which otherwise would have automatically \ndeployed the parachute.  The subsequent uncontrolled descent posed a safety hazard to \npeople and property on the ground.  Given the aircraft’s weight, if it had struck a person, it \nis likely that serious or even fatal injuries may have occurred.\n26\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 PW Orca AAIB",
            ", if it had struck a person, it \nis likely that serious or even fatal injuries may have occurred.\n26\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 PW Orca AAIB-30757\nConclusion\nA change to the aircraft’s operating software by its manufacturer meant that, under a \nparticular set of circumstances, it no longer performed as intended.  The SRP controller \nselection had remained in the disarm position when the aircraft took off, and the software \nbug resulted in the unintended in-flight shutdown of the aircraft’s electric propulsion motors, \nthe disabling of the aircraft’s safety parachute system from deploying, and a subsequent \nuncontrolled descent from a height of 60 m.\nThis accident highlights the importance of ensuring that change management processes \ninclude comprehensive scenario testing, particularly for safety-critical functions.  While the \nmanufacturer followed an iterative development process, this incident emphasises the need \nto validate software behaviour against all known operational cases.\nSafety actions\nFollowing this accident the following safety actions were taken:\nThe aircraft manufacturer has:\n ● Notified all operators about the safety critical software issue. \n ● Released new software to resolve the protection logic to ensure that the \n‘deglitch’ filter does not interfere with the arm/disarm switch protection \nfunction.\n ● Updated the flight and ground control manuals to highlight the importance of \nswitch state positions and to include additional information on the operation \nof the FTS and disarm function.\nThe aircraft manufacturer also stated that it is considering a change to the aircraft’s software \n",
            " Line Of Sight with Visual Mitigations (BVLOS VM) authorisation.\nThe cause of the accident was identified as a software bug in combination with a loss \nof synchronisation between the Remote Pilot (RP) and the Safety Remote Pilot (SRP), \nwhereby the SRP’s hand controller had remained set to the disarm position when the \naircraft had taken off.  When the aircraft came within range of the SRP’s controller, this \nresulted in power being removed from the aircraft’s electric propulsion motors, leading to \nthe aircraft stalling, its emergency parachute system being disabled, and a subsequent \nuncontrolled descent from a height of 60 m.\nHistory of the flight\nA number of flights were being flown a total distance of about 1.5 nm between a farm and a \nfield adjacent to Coventry Hospital (Figure 1).  These were being performed in preparation \nfor a BVLOS VM demonstration flight.\n16\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 PW Orca AAIB-30757\nThe flight crew consisted of a Remote Pilot (RP), Safety Remote Pilot (SRP), Pad Manager \n(PM), Visual Observer (VO) 1 and an Emergency Response Team (ERP).  The PM was \nlocated at the farm site and had a handheld controller that allowed the aircraft to take off and \nland.  The SRP was at the hospital landing site and had a remote controller that provided \nthe ability to take manual flight control of the aircraft, arm and",
            "12\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 9/2025 G-CDOP AAIB-30871\nAccident\n \nAircraft Type and Registration: Pegasus Quik, G-CDOP \nNo & Type of Engines: 1 Rotax 912ULS piston engine\nYear of Manufacture: 2005 (Serial no: 8129)\nDate & Time (UTC): 11 May 2025 at 0930 hrs\nLocation: Perth Airport\nType of Flight: Private \nPersons on Board: Crew - 1 Passengers - 1\n \nInjuries: Crew - None Passengers - None\n \nNature of Damage: Torn section of the trailing edge of the right side \nof the wing \nCommander’s Licence: National Private Pilot’s Licence \nCommander’s Age: 67 years\nCommander’s Flying Experience: 299 hours (of which 299 were on type)\n Last 90 days - 10 hours\n Last 28 days -   3 hours\nInformation Source: Aircraft Accident Report Form submitted by the \npilot\n \nSynopsis\nThe pilot was returning to Perth Airport after a local flight and reported the aircraft pitching \nand becoming difficult to control.  On landing, he discovered damage to the right trailing \nedge of the wing.  No other damage was reported to the aircraft and the pilot considered \nhe may have collided with a UAV.  It was noted that neither the pilot nor his passenger was \nwearing their diagonal seat harnesses.   \nHistory of the flight",
            " from onboard the aircraft and the RP ground control station.  \nThe onboard data included the control signals received from the RP station.  It also included \nthose from the SRP controller4 but only when it was in range.  The SRP controller does not \nrecord any data.\nFootnote\n4 The remote pilot ground station uses a command-and-control signal (C2) which is designed to provide a \npermanent connection with the aircraft.  The remote safety pilot controller uses a 2.4 GHz radio frequency \nsignal that will lose connection when the aircraft is either out of range or the signal is masked by terrain \nfeatures or structures.\n23\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 PW Orca AAIB-30757\nThe data showed that during the flight prior to the accident, the SRP controller was correctly \nset to the arm position.  This signal was recorded by the aircraft for about 90 seconds until \nit moved out of range of the SRP controller and communication was lost.  About 80 seconds \nlater, the aircraft landed at the farm site, where the PM replaced the aircraft’s battery pack.  \nThe aircraft then took off to fly back to the hospital site under automatic flight control.\nThe takeoff and initial cruise were normal, and when at a distance of about 0.7 nm from \nthe hospital site, the communication link was re-established between the aircraft and  \nSRP controller.  The recorded signals showed that at this point the arm/disarm switch on the \n",
            " wing.  No other damage was reported to the aircraft and the pilot considered \nhe may have collided with a UAV.  It was noted that neither the pilot nor his passenger was \nwearing their diagonal seat harnesses.   \nHistory of the flight\nThe pilot was returning to Runway 09 at Perth Airport after a local flight with a passenger.  \nHe was at about 2,000 ft agl in the vicinity of Perth Racecourse, approximately 3 nm west \nof the airport and described how the aircraft suddenly “pitched to the right” as if he had “hit \na deep pothole whilst driving”.  He reported the aircraft was difficult to handle and that when \nhe tried to reduce speed it became unstable and shook.  He stated it was also difficult to \nkeep the aircraft straight whilst on the approach, although the pilot managed to carry out a \nsuccessful landing.  When taxiing after landing, the pilot noticed that there was damage to \na section of the trailing edge on the right wing, with some tears in the material.\nThe aircraft was later inspected but no other damage was found, and it was reported that \nthe damage to the wing was not considered to be due to an object coming off the aircraft \nor a strike by the aircraft’s propeller.  Without an obvious cause it was suggested that the \n13\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 9/2025 G-CDOP AAIB-30871\naircraft may have collided with a UAV.  The pilot noted"
        ]
    },
    {
        "question": "What were the safety actions taken after the Uvify IFO incident?",
        "ground_truth_chunks": [
            "14\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 9/2025 Uvify IFO AAIB-30820\nSerious Incident\n \nAircraft Type and Registration: UAS Uvify IFO multirotor\nNo & Type of Engines: 4 Uvify brushless electric motors\nYear of Manufacture: 2020 (Serial no: 203382IFOD0150100085)\nDate & Time (UTC): 29 March 2025 at 1926 hrs\nLocation: Durham\nType of Flight: Commercial Operations (UAS) \nPersons on Board: Crew - None Passengers - None\n \nInjuries: Crew - N/A Passengers - N/A \nNature of Damage: None\nCommander’s Licence: Other \nCommander’s Age: 38 years\nCommander’s Flying Experience: 52 hours (of which 51 were on type)\n Last 90 days - 6 hours\n Last 28 days - 0 hours\nInformation Source: Aircraft Accident Report Form submitted by the \npilot\nThe unmanned aircraft (UA) was one of a swarm of 540 being flown within an area, about \n50 m in diameter.  A sterile flight area extended a further 60 m out in all directions.\nDuring the flight, the UA began to climb, deviating from its intended flightpath to a height of \n196 m, which was outside of the defined geofence.  At this point, the motors automatically \ncut, and the UA fell to the ground,",
            " be piloted at East Midlands that is people-\ncentred and focuses on decision making, leadership and wellbeing.\nStaff engagement\n ● The amount of face-to-face contact between ramp staff and their managers \nwas increased.\n ● Additional guidance has been prepared for managers across the company \nconcerning safety leader behaviour at different levels of the organisation \nand how to conduct safety leadership walks.\nDispatch training:\n ● Improved rostering of dispatch on-the-job trainers so that an appropriately \nqualified trainer is always available.\n ● The process of trainee dispatchers observing or shadowing during their \ntraining was reviewed.\n ● Trainee dispatchers now have a second set of shadow paperwork that they \ncan work on whilst training.\n24\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin:  G-TAWB AAIB-30560\nCross industry collaboration:\n ● The Ground Handling Operations Safety Team (GHOST) 4, established by \nthe CAA, have produced a video on fall from height risk which the ground \nhandling company will share with their staff.\n ● The ground handling company and operator will deliver a collaborative \npresentation regarding this accident at a GHOST meeting.\nOperator\nThe operator took the following action after the accident:\n ● A safety notice was issued to highlight the dangers to crew during step \nremoval.\n ● The operator has amended the next revision of its SEP manual to stipulate \nthat both feet will be kept inside the aeroplane during the door closing \nprocedure.\nThe operator will also initiate a collaborative review across industry to develop a redesigned \npassenger stairs",
            ", if it had struck a person, it \nis likely that serious or even fatal injuries may have occurred.\n26\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 PW Orca AAIB-30757\nConclusion\nA change to the aircraft’s operating software by its manufacturer meant that, under a \nparticular set of circumstances, it no longer performed as intended.  The SRP controller \nselection had remained in the disarm position when the aircraft took off, and the software \nbug resulted in the unintended in-flight shutdown of the aircraft’s electric propulsion motors, \nthe disabling of the aircraft’s safety parachute system from deploying, and a subsequent \nuncontrolled descent from a height of 60 m.\nThis accident highlights the importance of ensuring that change management processes \ninclude comprehensive scenario testing, particularly for safety-critical functions.  While the \nmanufacturer followed an iterative development process, this incident emphasises the need \nto validate software behaviour against all known operational cases.\nSafety actions\nFollowing this accident the following safety actions were taken:\nThe aircraft manufacturer has:\n ● Notified all operators about the safety critical software issue. \n ● Released new software to resolve the protection logic to ensure that the \n‘deglitch’ filter does not interfere with the arm/disarm switch protection \nfunction.\n ● Updated the flight and ground control manuals to highlight the importance of \nswitch state positions and to include additional information on the operation \nof the FTS and disarm function.\nThe aircraft manufacturer also stated that it is considering a change to the aircraft’s software \n",
            " 2025\n AAIB Bulletin:  G-TAWB AAIB-30560\nThe interlock prevents the steps from being moved until this barrier is closed.  Therefore, \nalthough they can still be moved when someone is descending, they cannot be moved \nbefore the aircraft door is closed which would have prevented the SCCM from falling.  The \nground handling company was already in the process of replacing the basic steps with \nthose with interlocking barriers when the accident occurred and hopes to have completed \nthis by the end of 2025.\nSurvivability\nThe co-pilot did call ATC, telling them that a member of the crew had fallen from the \nsteps, but ATC could not see the aircraft, nor did they have a good understanding of the \nseriousness of the accident.  As a result, the response of the RFFS was not as rapid as it \nwould have been had an emergency been declared although it likely made no difference to \nthe time of ambulance arrival.  Whilst CAP413 does not provide any guidance for on-ground \nemergencies it does suggest that pilots should declare an emergency as early as possible.  \nCrews should consider that if they believe the issue would involve a 999 call if they were \nat home, then they should think about declaring a formal emergency using the applicable \nprefix.  The response time likely made little difference in this case, but it is possible that it \nmight do in a similar event.\nInfluence of investigations and just culture\nThe ground handling company had an active safety culture improvement",
            " further safety actions because of \nthis accident that address various areas of learning highlighted in this report.\nProcedures and practice:\n ● Safety alerts and ground operating notices were issued to clarify that \nonly qualified ramp staff should interact with steps and to emphasise the \nimportance of checks that the aircraft door is closed and no one is on the \nsteps before they are moved.\n ● Improved briefing by ramp team leaders was introduced before each flight \nto allocate roles and identify the dispatchers and any trainees.\n23\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin:  G-TAWB AAIB-30560\n ● Trainee dispatchers are now identified by different coloured high visibility \nclothing.\n ● Any member of staff who joins a turnaround team to assist must first speak \nto the team leader to be allocated tasks.\nSafety assurance:\n ● Audit criteria were updated to check that only qualified ramp staff interact \nwith steps.\n ● Covert inspections were introduced to observe procedural compliance in \nterms of the step removal procedure.\nSafety culture and the investigation of delays and safety events:\n ● The investigation process was reviewed with the involvement of staff and \ninput of other similar companies and changes were introduced to the \nstatement form.\n ● The just culture policy and the accompanying training material was updated.\n ● A new kind of safety training will be piloted at East Midlands that is people-\ncentred and focuses on decision making, leadership and wellbeing.\nStaff engagement\n ● The amount of face-to-face contact between ramp staff and their managers \nwas increased.\n ● Additional guidance has been prepared for",
            " not supply the investigation with details of their flight licence, medical \nstatus, flying experience or recency.\nMeteorology\nThe reports submitted to the AAIB did not contain meteorological information, but the UK \nMet Office generated a limited aftercast for the time of the serious incident.  The report \nfound that:\n ● The weather conditions on the day were characterised by light east to north \neasterly winds with scattered cloud.  \n ● There was no indication, in the TAF or FIR Forecast of any low-level \n7\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin: 10/2025 N915GD AAIB-30603\nturbulence, except for that which might be expected in the vicinity of \nconvective clouds such as cumulonimbus (CB).\n ● The TUPJ TAF included a risk of thunderstorms from 1800 hrs UTC, with an \nassociated forecast reduction in visibility and cloud bases.\n ● The reported intensity of the rainfall at the airfield along with the number of \nlightning strikes recorded on the weather radar imagery at Figure 5 indicated \nan active CB cell was over or close to the territory at the time of the serious \nincident.\n ● There was no indication of any significant wind shear in association with the \nthunderstorms, but the Met Office did not have access to the full record of \nwind speed or direction.\nFigure 5\nWeather radar image at 1900 hrs Z on 6 November 2024 (crosses indicate lightning strikes)\nAircraft examination\n",
            " published Safety \nSense Leaflet 33: ‘VFR Flight Into IMC’, on 7 May 202410, advising pilots on how to avoid \nand respond to unintended IMC entry.  Of note, on page 3, the leaflet warns pilots:\n‘If you are not adequately trained and qualified in instrument flying, you will \nstruggle to control the aircraft in a VFR into IMC scenario. Flight with sole \nreference to the instruments is an additional skill above that required for VFR \nflight and without the correct training, the loss of visual references will likely \ncause spatial disorientation. You may suffer a loss of control accident’.\nFootnote\n7 UK Regulation (EU) No 923/2012, available at https://regulatorylibrary.caa.co.uk/923-2012-pdf/PDF.pdf \n[accessed June 2025].\n8 Available at https://www.caa.co.uk/general-aviation/safety-topics/the-skyway-code/ page 39 [accessed June \n2025].\n9 Available at https://www.gov.uk/aaib-reports/aaib-investigation-to-mudry-cap-10b-g-bxbu [accessed June \n2025].\n10 Available at https://www.caa.co.uk/publication/download/21918 [accessed June 2025].\n13\nAll times are UTC©  Crown copyright 2025\n AAIB Bulletin:  G-CMGB AAIB-30346\nSensory illusions and spatial disorientation\nThe body’s vestib",
            " steps vacated.  She suffered serious injuries in the fall.\nThe step removal process was conducted in a way that was not consistent with the written \npolicy and had insufficient safeguards to prevent movement of the steps with people on \nthem or the door still open.  This procedural workaround had been used by the staff at the \nground handling company for many years at East Midlands and at many other airports in \nthe UK.  \nThe presence of a dispatcher at the bottom on the steps releasing the stabilisers triggered \nthe steps to be moved without an effective check or confirmation that the door was closed \nand the steps were vacated.  The presence of multiple dispatchers, without the ramp team \nknowing who the official dispatcher was, set the conditions for this event to occur.  The step \nremoval procedure required that the ramp staff check that there were no personnel on the \nsteps before the stabilisers were retracted but the procedures did not specify how this was \nto be performed nor who was responsible for it.\nSafety actions\nGround handling company\nSome relevant safety improvement actions were already in progress prior to the accident.  \nThese include phasing out basic steps; an active programme to improve staff engagement; \nsafety leadership training for team leaders and supervisors and planned renovation of the \nramp crew facilities.\nThe ground handling company took several further safety actions because of \nthis accident that address various areas of learning highlighted in this report.\nProcedures and practice:\n ● Safety alerts and ground operating notices were issued to clarify that \nonly qualified ramp staff should interact with steps and to emphasise the",
            " the UA began to climb, deviating from its intended flightpath to a height of \n196 m, which was outside of the defined geofence.  At this point, the motors automatically \ncut, and the UA fell to the ground, landing in a hedge 50 m beyond the sterile flight area \nboundary.\nInvestigations by the operator, UA control software developers and the UA manufacturer \nagreed that vibrations on the z-axis, possibly due a worn motor, led to incorrect GNSS and \naltitude estimations.  The UA erroneously believed it was descending and so applied thrust \nto climb, resulting in it climbing out of formation with the other UAs.\nSafety actions identified by the operator were to:\n1. Inspect the motors on all of their UAs for signs of wear, and replace where \nnecessary.\n2. Collaborate with the hardware and software manufacturers to develop a fix \nthat stops GNSS errors from causing the UA to go outside the geofence.\n3. Increase the size of the sterile flight area until the above measures have \nbeen completed.",
            " 6 January 2025.  \nUnaware that the aircraft had struck any obstacles on the approach, the flight crew did \nnot submit a safety report about the landing but provided the following brief statement on  \n8 November 2024 in response to the TUPJ airfield authorities’ enquiries.\n‘On November 6 the weather was marginal with rain on all quadrants, upon \napproaching runway 7 on short final started to experience wind gusts and \nprobably a downdraft [sic], seemed close to a low-level wind shear.  Applied \npower to arrest the descent.  I landed slightly short of the numbers.  I was totally \nunaware that I struck [anything].’\nAlthough they were requested from the commander, further details of the occurrence, \nwhich could have provided greater insight into the content and context of their 8 November \nstatement, were not provided to the AAIB.\nICAO Annex 13 (Aircraft Accident and Incident Investigation) Attachment C lists typical \nexamples of incidents that are likely to be classified as serious.  This list includes:\n‘Take-off or landing incidents. Incidents such as under-shooting, overrunning or \nrunning off the side of runways.’\nThe operator did not instigate an internal safety review for this serious incident.\nPersonnel\nThe commander did not supply the investigation with details of their flight licence, medical \nstatus, flying experience or recency.\nMeteorology\nThe reports submitted to the AAIB did not contain meteorological information, but the UK \nMet Office generated a limited aftercast for"
        ]
    }
]